Repository: realAYAYA/UnrealEngine-ToonLit
Catalog: UnrealEngine/Engine/Source/Programs/Enterprise/Datasmith/DatasmithRhinoExporter/SharedResources/Localization/Resources.*.resx
Languages: ja, pt

# ClearMessagesButton
source: Clear messages
ja: メッセージ削除
pt: Limpar mensagens

# ConnectionsDirectLinkButton
source: Connections
ja: 接続
pt: Conexões

# ConnectionsDirectLinkButtonTooltip
source: Management Connections
ja: 接続管理ウィンドウを開く
pt: Abrir janela de gerenciamento de conexão

source: Datasmith Export
ja: Datasmith エクスポート
pt: Exportação do Datasmith

# DatasmithExportButton
source: Export 3D View
ja: 3Dビューのエクスポート
pt: Exportar visualização 3D

# DatasmithExportButtonTooltip
source: Export to Datasmith file
ja: 3Dビューを .udatasmith ファイルにエクスポート
pt: Exportar visualização 3D para arquivo .udatasmith

# DatasmithExportMessage
source: Exporting to {0} Datasmith scene
ja: {0} Datasmith シーンにエクスポートする
pt: Exportando para a cena {0} do Datasmith.

# DatasmithMessagesButton
source: Messages
ja: メッセージ
pt: Mensagens

# DatasmithMessagesButtonTooltip
source: Open Datasmith messages window
ja: Datasmith メッセージ ウィンドウを開く
pt: Abrir janela de mensagens do Datasmith

# DatasmithMessagesTitle
source: Datasmith Messages
ja: Datasmith メッセージ
pt: Mensagens do Datasmith

source: Exporting Actors
ja: アクタのエクスポート
pt: Exportando atores

source: Exporting Materials
ja: マテリアルのエクスポート
pt: Exportando materiais

source: Exporting Meshes
ja: メッシュのエクスポート
pt: Exportando malhas

source: Exporting Scene
ja: シーンのエクスポート
pt: Exportando cena

source: Exporting Textures
ja: テクスチャのエクスポート
pt: Exportando texturas

source: Parsing Document
ja: ドキュメントの解析
pt: Analisando documento

# PressEscToCancel
source: Press Esc key to cancel...
ja: Esc キーを押してキャンセルします…
pt: Pressione a tecla Esc para cancelar...

# SaveDialogTitle
source: Export to Datasmith file
ja: Datasmith シーンにエクスポートする
pt: Exportar para a cena do Datasmith

# SynchronizeDirectLinkButton
source: Synchronize
ja: 同期
pt: Sincronizar

# SynchronizeDirectLinkButtonTooltip
source: Synchronize with Direct Link
ja: DirectLink と同期
pt: Sincronizar DirectLink

# UnexpectedError
source: An unexpected error has occurred:
ja: 予期しないエラーが発生しました：
pt: Ocorreu um erro inesperado:

# UnsupportedActor
source: RhinoObject {0} of type "{1}" is not supported and was not exported.
ja: "{1}" タイプの RhinoObject {0}はサポートされていないため、エクスポートされませんでした。
pt: RhinoObject {0} do tipo "{1}" não é compatível e não foi exportado.

# UntitledFileName
source: Untitled
ja: 無題
pt: Sem título
